modules/common/src/test/resources/com/l7tech/common/resources/bug7170-str-transform-x509data.xml

<!--
  Message signed using STR with X509Data/X509IssuerSerial signed with STR-Transform
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
<wsse:Security actor="secure_span" soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsu:Timestamp wsu:Id="Timestamp-1-e7f32fdd81f2f1f54db1f2471d7b5709"><wsu:Created>2009-05-06T20:14:20.976219931Z</wsu:Created><wsu:Expires>2009-05-06T20:19:20.976Z</wsu:Expires></wsu:Timestamp><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#Body-0-dbc412f0ea0604f37be95fcbb56a7118"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>4XhFKEhe82yigpvzNCYs1vx5aXc=</ds:DigestValue></ds:Reference><ds:Reference URI="#Timestamp-1-e7f32fdd81f2f1f54db1f2471d7b5709"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>Vk0zNQ2poZYDQzai8r2oyHXl8/s=</ds:DigestValue></ds:Reference><ds:Reference URI="#SecurityTokenReference-2-b3af6c7b5e14b0552e81cb23459b87e9"><ds:Transforms><ds:Transform Algorithm="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#STR-Transform"><wsse:TransformationParameters xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"/></wsse:TransformationParameters></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>eRLBN849YvF5Dhy6GniJtRLAws8=</ds:DigestValue></ds:Reference></ds:SignedInfo>
<ds:SignatureValue>oolqR7WeTst1FbN5zpQiBNabSjFKU25FeqtKuKGprPzvpcTB9YHqedhtvOo4jXLPMyi0p07MmpR1xnltr1B5Jro9wDZad35WW4FXcMdHnND3UPMuQyJeyOMLZ5gklG/VojBss4egZ6U9LR5bt5MK5xIlVWAHMyA+qKqLcKJX8Kg=</ds:SignatureValue>
<ds:KeyInfo>
<wsse:SecurityTokenReference wsu:Id="SecurityTokenReference-2-b3af6c7b5e14b0552e81cb23459b87e9" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:X509Data xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:X509IssuerSerial><ds:X509IssuerName>CN=OASIS Interop Test CA, O=OASIS</ds:X509IssuerName><ds:X509SerialNumber>68652640310044618358965661752471103641</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
    <soapenv:Body wsu:Id="Body-0-dbc412f0ea0604f37be95fcbb56a7118" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <tns:listProducts xmlns:tns="http://warehouse.acme.com/ws">
            <tns:delay>int</tns:delay>
        </tns:listProducts>
    </soapenv:Body>
</soapenv:Envelope>